export const zw = ['紫微', '天机', '', '太阳', '武曲', '天同', '', '', '廉贞', '', '', '']
export const tf = ['天府', '太阴', '贪狼', '巨门', '天相', '天梁', '七杀', '', '', '', '破军', '']
export const base = ['1命', '2兄弟', '3夫妻', '4子女', '5财帛', '6疾厄', '7迁移', '8交友', '9官禄', '10田宅', '11福德', '12父母']
export const zwStatus = {
  0: '(平)',
  1: '(庙)',
  2: '(旺)',
  3: '(旺)',
  4: '(得)',
  5: '(旺)',
  6: '(庙)',
  7: '(庙)',
  8: '(旺)',
  9: '(旺)',
  10: '(得)',
  11: '(旺)',
} 

export const tjStatus = {
  0: '(庙)',
  1: '(陷)',
  2: '(得)',
  3: '(旺)',
  4: '(利)',
  5: '(平)',
  6: '(庙)',
  7: '(陷)',
  8: '(得)',
  9: '(旺)',
  10: '(利)',
  11: '(平)',
}

export const tyStatus = {
  0: '(陷)',
  1: '(不)',
  2: '(旺)',
  3: '(庙)',
  4: '(旺)',
  5: '(旺)',
  6: '(旺)',
  7: '(得)',
  8: '(得)',
  9: '(平)',
  10: '(不)',
  11: '(陷)',
}

export const wqStatus = {
  0: '(旺)',
  1: '(庙)',
  2: '(得)',
  3: '(利)',
  4: '(庙)',
  5: '(平)',
  6: '(旺)',
  7: '(庙)',
  8: '(得)',
  9: '(利)',
  10: '(庙)',
  11: '(平)',
}

export const ttStatus = {
  0: '(旺)',
  1: '(不)',
  2: '(利)',
  3: '(平)',
  4: '(平)',
  5: '(庙)',
  6: '(陷)',
  7: '(不)',
  8: '(旺)',
  9: '(平)',
  10: '(平)',
  11: '(庙)',
}

export const lzStatus = {
  0: '(平)',
  1: '(利)',
  2: '(庙)',
  3: '(平)',
  4: '(利)',
  5: '(陷)',
  6: '(平)',
  7: '(利)',
  8: '(庙)',
  9: '(平)',
  10: '(利)',
  11: '(陷)',
}

export const tfStatus = {
  0: '(庙)',
  1: '(庙)',
  2: '(庙)',
  3: '(得)',
  4: '(庙)',
  5: '(得)',
  6: '(旺)',
  7: '(庙)',
  8: '(得)',
  9: '(旺)',
  10: '(庙)',
  11: '(得)',
}

export const yueStatus = {
  0: '(庙)',
  1: '(庙)',
  2: '(旺)',
  3: '(陷)',
  4: '(陷)',
  5: '(陷)',
  6: '(不)',
  7: '(不)',
  8: '(利)',
  9: '(旺)',
  10: '(旺)',
  11: '(庙)',
}

export const tlStatus = {
  0: '(旺)',
  1: '(庙)',
  2: '(不)',
  3: '(利)',
  4: '(庙)',
  5: '(陷)',
  6: '(旺)',
  7: '(庙)',
  8: '(平)',
  9: '(利)',
  10: '(庙)',
  11: '(陷)',
}

export const jmStatus = {
  0: '(旺)',
  1: '(不)',
  2: '(庙)',
  3: '(庙)',
  4: '(陷)',
  5: '(旺)',
  6: '(旺)',
  7: '(平)',
  8: '(庙)',
  9: '(庙)',
  10: '(陷)',
  11: '(旺)',
}

export const txStatus = {
  0: '(庙)',
  1: '(庙)',
  2: '(庙)',
  3: '(陷)',
  4: '(得)',
  5: '(得)',
  6: '(庙)',
  7: '(得)',
  8: '(庙)',
  9: '(陷)',
  10: '(得)',
  11: '(得)',
}

export const tllStatus = {
  0: '(庙)',
  1: '(旺)',
  2: '(庙)',
  3: '(庙)',
  4: '(庙)',
  5: '(得)',
  6: '(庙)',
  7: '(旺)',
  8: '(陷)',
  9: '(得)',
  10: '(庙)',
  11: '(陷)',
}

export const qsStatus = {
  0: '(旺)',
  1: '(庙)',
  2: '(庙)',
  3: '(旺)',
  4: '(庙)',
  5: '(平)',
  6: '(旺)',
  7: '(庙)',
  8: '(庙)',
  9: '(旺)',
  10: '(庙)',
  11: '(平)',
}

export const pjStatus = {
  0: '(庙)',
  1: '(旺)',
  2: '(得)',
  3: '(陷)',
  4: '(旺)',
  5: '(平)',
  6: '(庙)',
  7: '(旺)',
  8: '(得)',
  9: '(陷)',
  10: '(旺)',
  11: '(平)',
}

// 14主星亮度
export const starStatus =  {
  '紫微': zwStatus,
  '天机': tjStatus,
  '太阳': tyStatus,
  '武曲': wqStatus,
  '天同': ttStatus,
  '廉贞': lzStatus,
  '天府': tfStatus,
  '太阴': yueStatus,
  '贪狼': tlStatus,
  '巨门': jmStatus,
  '天相': txStatus,
  '天梁': tllStatus,
  '七杀': qsStatus,
  '破军': pjStatus
}

/** 根据紫微位置获取其他14主星位置 */
export const otherIndexByZw = (num: number) => {
  switch (num) {
    case 0:
      return {
        '紫微': 0,
        '天机': 11,
        '太阳': 9,
        '武曲': 8,
        '天同': 7,
        '廉贞': 4,
        '天府': 4,
        '太阴': 5,
        '贪狼': 6,
        '巨门': 7,
        '天相': 8,
        '天梁': 9,
        '七杀': 10,
        '破军': 2,
      }
    case 1:
      return {
        '紫微': 1,
        '天机': 0,
        '太阳': 10,
        '武曲': 9,
        '天同': 8,
        '廉贞': 5,
        '天府': 3,
        '太阴': 4,
        '贪狼': 5,
        '巨门': 6,
        '天相': 7,
        '天梁': 8,
        '七杀': 9,
        '破军': 1,
      }
    case 2:
      return {
        '紫微': 2,
        '天机': 1,
        '太阳': 11,
        '武曲': 10,
        '天同': 9,
        '廉贞': 6,
        '天府': 2,
        '太阴': 3,
        '贪狼': 4,
        '巨门': 5,
        '天相': 6,
        '天梁': 7,
        '七杀': 8,
        '破军': 0,
      }
    case 3:
      return {
        '紫微': 3,
        '天机': 2,
        '太阳': 0,
        '武曲': 11,
        '天同': 10,
        '廉贞': 7,
        '天府': 1,
        '太阴': 2,
        '贪狼': 3,
        '巨门': 4,
        '天相': 5,
        '天梁': 6,
        '七杀': 7,
        '破军': 11,
      }
    case 4:
      return {
        '紫微': 4,
        '天机': 3,
        '太阳': 1,
        '武曲': 0,
        '天同': 11,
        '廉贞': 8,
        '天府': 0,
        '太阴': 1,
        '贪狼': 2,
        '巨门': 3,
        '天相': 4,
        '天梁': 5,
        '七杀': 6,
        '破军': 10,
      }
    case 5:
      return {
        '紫微': 5,
        '天机': 4,
        '太阳': 2,
        '武曲': 1,
        '天同': 0,
        '廉贞': 9,
        '天府': 11,
        '太阴': 0,
        '贪狼': 1,
        '巨门': 2,
        '天相': 3,
        '天梁': 4,
        '七杀': 5,
        '破军': 9,
      }
    case 6:
      return {
        '紫微': 6,
        '天机': 5,
        '太阳': 3,
        '武曲': 2,
        '天同': 1,
        '廉贞': 10,
        '天府': 10,
        '太阴': 11,
        '贪狼': 0,
        '巨门': 1,
        '天相': 2,
        '天梁': 3,
        '七杀': 4,
        '破军': 8,
      }
    case 7:
     return {
      '紫微': 7,
      '天机': 6,
      '太阳': 4,
      '武曲': 3,
      '天同': 2,
      '廉贞': 11,
      '天府': 9,
      '太阴': 10,
      '贪狼': 11,
      '巨门': 0,
      '天相': 1,
      '天梁': 2,
      '七杀': 3,
      '破军': 7,
    }
    case 8:
      return {
        '紫微': 8,
        '天机': 7,
        '太阳': 5,
        '武曲': 4,
        '天同': 3,
        '廉贞': 0,
        '天府': 8,
        '太阴': 9,
        '贪狼': 10,
        '巨门': 11,
        '天相': 0,
        '天梁': 1,
        '七杀': 2,
        '破军': 6,
      }
    case 9:
      return {
        '紫微': 9,
        '天机': 8,
        '太阳': 6,
        '武曲': 5,
        '天同': 4,
        '廉贞': 1,
        '天府': 7,
        '太阴': 8,
        '贪狼': 9,
        '巨门': 10,
        '天相': 11,
        '天梁': 0,
        '七杀': 1,
        '破军': 5,
      }
    case 10:
      return {
        '紫微': 10,
        '天机': 9,
        '太阳': 7,
        '武曲': 6,
        '天同': 5,
        '廉贞': 2,
        '天府': 6,
        '太阴': 7,
        '贪狼': 8,
        '巨门': 9,
        '天相': 10,
        '天梁': 11,
        '七杀': 0,
        '破军': 4,
      }
    case 11:
      return {
        '紫微': 11,
        '天机': 10,
        '太阳': 8,
        '武曲': 7,
        '天同': 6,
        '廉贞': 3,
        '天府': 5,
        '太阴': 6,
        '贪狼': 7,
        '巨门': 8,
        '天相': 9,
        '天梁': 10,
        '七杀': 11,
        '破军': 3,
      }
  }
}

